{"mtitle":"<h1>Mission</h1>","mcent":"<p>Granular data mining in big data analysis is an emerging field which crosses multiple research disciplines and industry domains. A vast number of real-world problems can be tackled using techniques encompassed in GrC. Granular data mining research explores the advantages, and also challenges, derived from collecting and mining vast amounts of real-world big data. The aims of this task force are: (1) to present the state-of-the-art research on granular data mining and its application in big data, and (2) to provide a forum for researchers to discuss the latest progress, new research methodologies, and potential research topics.</p>","ttitle":"<h1>Topics</h1>","tcent":"<h6>The topics scopes of this task force are as follows</h6><ul class='ul_dot'><li>Granular data mining for feature learning, classification, regression, and clustering</li><li>Granular data mining for multi-task modeling, multi-view modeling and co-learning</li><li>Granular data mining for large-scale image and multimedia processing</li><li>Granular data mining for brain-machine interfaces and medical signal analysis</li><li>Fuzzy-rough data mining and rough-fuzzy data mining</li><li>Fuzzy clustering/classification technique for big data</li><li>Fuzzy neural networks for big data analysis in uncertain environments</li><li>Probabilistic/Approximate/Case-based/Social reasoning for granular data mining</li><li>Granular fuzzy set algorithm and application in big data</li><li>Granular rough set algorithm and application in big data</li><li>Granular data mining with multi-objective evolutionary algorithm</li><li>Granular deep learning to support the decision process of big data</li><li>Fuzzy granular support vector machines and application in big data</li><li>Granular computing for big data-driven decision support systems</li><li>Novel/emerging forms of granular data mining</li><li>Application of Granular data mining technology in large-scale healthcare data</li><li>Other applications in real-world big data</li></ul>"}